FemDesign.Loads.LoadCombination
load_combination_type

FemDesign.Loads.LoadCombination.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.LoadCombination.#ctor(System.String,FemDesign.Loads.LoadCombType,System.Collections.Generic.List{FemDesign.Loads.LoadCase},System.Collections.Generic.List{System.Double},FemDesign.Calculate.CombItem)
Internal constructor. Used for GH components and Dynamo nodes.

FemDesign.Loads.LoadCombination.SetCalculationSettings(FemDesign.Calculate.CombItem)
Set the load combination-specific calculation settings. This is known as "Setup by load combinations" in FEM-Design GUI.
combItem: Load combination-specific settings. The default settings will be used if the value is null.

FemDesign.Loads.LoadCombination.GetLoadCaseGuidsAsString
Get LoadCase guids of LoadCases in LoadCombination.

FemDesign.Loads.LoadCombination.GetGammas
Get gamma values of LoadCases in LoadCombination.

FemDesign.Loads.LoadCombination.AddLoadCase(FemDesign.Loads.LoadCase,System.Double)
Add LoadCase to LoadCombination.

FemDesign.Loads.LoadCombination.LoadCaseInLoadCombination(FemDesign.Loads.LoadCase)
Check if LoadCase in LoadCombination.